spec/cassettes/PinPaymentService/declined/captures_an_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://LElcjB_z4BItXJQPYlw43g:@test-api.pin.net.au/1/charges
    body:
      encoding: US-ASCII
      string: email=blah%40vtha.com&amount=1000&currency=USD&description=Order+%23R851637568-%5BRANDOM%5D&ip_address=10.10.10.10&card%5Baddress_line1%5D=Address&card%5Baddress_city%5D=City&card%5Baddress_country%5D=Australia&card%5Bnumber%5D=5560000000000001&card%5Bexpiry_month%5D=1&card%5Bexpiry_year%5D=2020&card%5Bname%5D=Blah+Vtha
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - PinPayment::Charge/0.5.1
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 400
      message: Bad Request
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Wed, 23 Sep 2015 15:07:15 GMT
      Server:
      - Apache
      Status:
      - 400 Bad Request
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - d97dbaa633d6d407312eb5db9e296a0d
      X-Runtime:
      - '0.121423'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '112'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"error":"card_declined","error_description":"The card was declined","charge_token":"ch_SgJzrZIlX2WJAvoSjAcluw"}'
    http_version: 
  recorded_at: Wed, 23 Sep 2015 15:07:15 GMT
- request:
    method: post
    uri: https://LElcjB_z4BItXJQPYlw43:@test-api.pin.net.au/1/charges
    body:
      encoding: US-ASCII
      string: email=blah%40vtha.com&amount=1000&currency=USD&description=Order+%23R851637568-%5BRANDOM%5D&ip_address=10.10.10.10&card%5Baddress_line1%5D=Address&card%5Baddress_city%5D=City&card%5Baddress_country%5D=Australia&card%5Bnumber%5D=5560000000000001&card%5Bexpiry_month%5D=1&card%5Bexpiry_year%5D=2020&card%5Bname%5D=Blah+Vtha
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - PinPayment::Charge/0.5.1
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Wed, 23 Sep 2015 15:08:54 GMT
      Server:
      - Apache
      Status:
      - 401 Unauthorized
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - 577e0e41a0d52bb968e75f07d02f4547
      X-Runtime:
      - '0.031985'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '81'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"error":"unauthenticated","error_description":"Not authorised. (Check
        API Key)"}'
    http_version: 
  recorded_at: Wed, 23 Sep 2015 15:08:54 GMT
recorded_with: VCR 2.9.3
