spec/cassettes/PinPaymentService/valid/captures_an_error.yml

---
http_interactions:
- request:
    method: post
    uri: https://LElcjB_z4BItXJQPYlw43g:@test-api.pin.net.au/1/charges
    body:
      encoding: US-ASCII
      string: email=blah%40vtha.com&amount=1000&currency=USD&description=Order+%23R851637568-%5BRANDOM%5D&ip_address=10.10.10.10&card%5Baddress_line1%5D=Address&card%5Baddress_city%5D=City&card%5Baddress_country%5D=Australia&card%5Bnumber%5D=5520000000000000&card%5Bexpiry_month%5D=1&card%5Bexpiry_year%5D=2020&card%5Bname%5D=Blah+Vtha
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - PinPayment::Charge/0.5.1
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 201
      message: Created
    headers:
      Cache-Control:
      - max-age=0, private, must-revalidate
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Wed, 23 Sep 2015 15:07:22 GMT
      Etag:
      - '"c7feec24fd660582434ac01827c7439c"'
      Server:
      - Apache
      Status:
      - 201 Created
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - 5c902cb6c077d2519e4f04fba4cf9738
      X-Runtime:
      - '0.226937'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '791'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"response":{"token":"ch_TtH2imG9cLRNBCIysKvyDg","success":true,"amount":1000,"currency":"USD","description":"Order
        #R851637568-[RANDOM]","email":"blah@vtha.com","ip_address":"10.10.10.10","created_at":"2015-09-23T15:07:22Z","status_message":"Success","error_message":null,"card":{"token":"card_ye5d90fLRYDNPGRAysRFKw","scheme":"master","display_number":"XXXX-XXXX-XXXX-0000","expiry_month":1,"expiry_year":2020,"name":"Blah
        Vtha","address_line1":"Address","address_line2":null,"address_city":"City","address_postcode":null,"address_state":null,"address_country":"Australia","customer_token":null,"primary":null},"transfer":[],"amount_refunded":0,"total_fees":null,"merchant_entitlement":null,"refund_pending":false,"authorisation_expired":false,"captured":true,"settlement_currency":"AUD"}}'
    http_version: 
  recorded_at: Wed, 23 Sep 2015 15:07:22 GMT
- request:
    method: post
    uri: https://LElcjB_z4BItXJQPYlw43:@test-api.pin.net.au/1/charges
    body:
      encoding: US-ASCII
      string: email=blah%40vtha.com&amount=1000&currency=USD&description=Order+%23R851637568-%5BRANDOM%5D&ip_address=10.10.10.10&card%5Baddress_line1%5D=Address&card%5Baddress_city%5D=City&card%5Baddress_country%5D=Australia&card%5Bnumber%5D=5520000000000000&card%5Bexpiry_month%5D=1&card%5Bexpiry_year%5D=2020&card%5Bname%5D=Blah+Vtha
    headers:
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - PinPayment::Charge/0.5.1
      Content-Type:
      - application/x-www-form-urlencoded
  response:
    status:
      code: 401
      message: Unauthorized
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json; charset=utf-8
      Date:
      - Wed, 23 Sep 2015 15:09:01 GMT
      Server:
      - Apache
      Status:
      - 401 Unauthorized
      Strict-Transport-Security:
      - max-age=31536000
      Vary:
      - User-Agent
      X-Rack-Cache:
      - invalidate, pass
      X-Request-Id:
      - ec169ceb4fb6544a8964b6cfca143a2f
      X-Runtime:
      - '0.030674'
      X-Ua-Compatible:
      - IE=Edge,chrome=1
      Content-Length:
      - '81'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"error":"unauthenticated","error_description":"Not authorised. (Check
        API Key)"}'
    http_version: 
  recorded_at: Wed, 23 Sep 2015 15:09:01 GMT
recorded_with: VCR 2.9.3
